{
  "version": 3,
  "category": "MASTERMIND",
  "defaults": {
    "messageIntervalSec": 8,
    "phaseSplit": { "setup": 0.30, "execution": 0.45, "climax": 0.25 },
    "cooldowns": { "onFailSec": 180, "onArrestSec": 300 }
  },
  "crimes": [
    {
      "type": "BANK_HEIST",
      "name": "Bank Heist",
      "durationSeconds": 240,
      "paths": [
        {
          "setup": [
            "The plan has been rehearsed until every pause feels natural. Masks in duffel bags, getaway routes memorized. The city outside hums with ordinary life, unaware of the storm about to break."
          ],
          "execution": [
            "Doors swing wide, shouts echo under fluorescent lights. One crew secures the lobby, another the vault. Seconds stretch thin as bags fill with cash. Radios crackle with updates, each voice betraying strain."
          ],
          "climax": {
            "success": "The alarms are delayed just long enough. Tires screech as you vanish into traffic, the city swallowed behind you with millions in tow.",
            "partial": "You make it out, but dye packs burst in the loot. Half ruined, half intact — a bitter win.",
            "fail": "The vault lock resists longer than planned. Every second feels stolen until you abandon the haul and bolt empty-handed.",
            "caught": "Sirens converge as spike strips bloom across asphalt. The van fishtails, your empire ending in handcuffs."
          },
          "ambient": [
            "The vault hums with mechanical life.",
            "Crowds murmur outside the lobby glass.",
            "Radios spit clipped words across channels.",
            "A fluorescent light flickers overhead.",
            "The metallic smell of gun oil lingers.",
            "Boots squeak against polished floors.",
            "A printer rattles somewhere in an office.",
            "Distant sirens blur into city noise.",
            "Your own pulse hammers louder than anything else."
          ],
          "outcomes": [
            { "type": "success", "weight": 28 },
            { "type": "partial", "weight": 25 },
            { "type": "fail", "weight": 27 },
            { "type": "caught", "weight": 20 }
          ]
        }
      ]
    },
    {
      "type": "ART_THEFT",
      "name": "Art Theft",
      "durationSeconds": 300,
      "paths": [
        {
          "setup": [
            "The museum map is etched into memory, each patrol studied and timed. Cutting glass, evading sensors — it’s as much art as the canvas you’re here to steal."
          ],
          "execution": [
            "Security lasers sweep in arcs, cameras tilt on slow pivots. You glide between shadows, gloves leaving no trace. The painting waits, timeless, as alarms slumber under rewired circuits."
          ],
          "climax": {
            "success": "The frame slides into its case, wrapped before dawn. A masterpiece disappears into the underground, and the world won’t notice for days.",
            "partial": "The canvas tears as you rush the extraction. Priceless, but damaged — value slashed with a careless move.",
            "fail": "The rigged sensors trigger early. You freeze, then fade into the night with nothing gained.",
            "caught": "Floodlights roar alive, and boots thunder toward you. The masterpiece remains on the wall as cuffs click shut."
          },
          "ambient": [
            "Air vents sigh through narrow ducts.",
            "The marble floor echoes each step.",
            "Distant chatter from night guards carries low.",
            "Glass cases creak under shifting pressure.",
            "Motion sensors tick faintly like clocks.",
            "The faint scent of varnish lingers in the air.",
            "Emergency lights glow dim red in corners.",
            "A muffled cough betrays a guard’s boredom.",
            "Your breath fogs faintly in the cold gallery air."
          ],
          "outcomes": [
            { "type": "success", "weight": 27 },
            { "type": "partial", "weight": 24 },
            { "type": "fail", "weight": 28 },
            { "type": "caught", "weight": 21 }
          ]
        }
      ]
    },
    {
      "type": "POLITICAL_ASSASSINATION",
      "name": "Political Assassination",
      "durationSeconds": 250,
      "paths": [
        {
          "setup": [
            "The speech is scheduled, the stage framed in banners. You’ve chosen the perch days in advance, every angle and exit planned. Tonight, history bends in silence and smoke."
          ],
          "execution": [
            "Crowds roar and clap, cameras flash. Through the scope, the world narrows to crosshairs and breath. Guards shift uneasily, radios buzzing with coded chatter. Time itself waits for your finger."
          ],
          "climax": {
            "success": "The shot lands. Panic blooms, the crowd fractures. In the chaos, you vanish, your name never spoken but your mark undeniable.",
            "partial": "The bullet strikes, but the target stumbles away wounded. Chaos erupts, but the mission falls short.",
            "fail": "The shot misfires, silencer hissing uselessly. The moment is gone, your chance dissolved into noise.",
            "caught": "A guard catches the glint too soon. Boots storm the stairwell, and the rifle clatters from your hands."
          },
          "ambient": [
            "The crowd chants in waves of sound.",
            "Flags snap in the night air.",
            "Cameras click like endless insects.",
            "The podium mic squeals briefly.",
            "Spotlights sweep across the stands.",
            "A helicopter thrums in the distance.",
            "Someone coughs nervously in the crowd.",
            "Radios crackle with coded numbers.",
            "Your scope fogs with your breath."
          ],
          "outcomes": [
            { "type": "success", "weight": 25 },
            { "type": "partial", "weight": 23 },
            { "type": "fail", "weight": 28 },
            { "type": "caught", "weight": 24 }
          ]
        }
      ]
    },
    {
      "type": "CRIME_SYNDICATE",
      "name": "Form a Crime Syndicate",
      "durationSeconds": 320,
      "paths": [
        {
          "setup": [
            "The warehouse echoes with voices, each seat filled by someone who owes you or fears you. Plans are spread across the table, maps and ledgers littered with possibility. Tonight isn’t a job — it’s the birth of an empire."
          ],
          "execution": [
            "Territories are divided, rules laid down. Money and blood flow in promises, alliances forged under the watch of sharpened eyes. Every nod is a contract, every silence a threat."
          ],
          "climax": {
            "success": "By the night’s end, the syndicate breathes like a single body. Streets bend to your will, business flows through your name.",
            "partial": "Half the room pledges loyalty, the rest leave with doubts. The foundation holds, but cracks are already visible.",
            "fail": "Arguments boil over into fists and knives. The plan dissolves, leaving you with nothing but enemies.",
            "caught": "Undercover ears catch every word. The doors crash open mid-speech, and the dream ends in steel cuffs."
          },
          "ambient": [
            "Chairs scrape across the concrete floor.",
            "A single bulb flickers overhead.",
            "Cigarette smoke thickens the air.",
            "Whispers ripple between tense men.",
            "Glasses clink with cheap liquor.",
            "A dog barks outside the loading dock.",
            "The hum of a fridge rattles in the corner.",
            "Rain patters against the warehouse roof.",
            "Your hand taps the map, steady as stone."
          ],
          "outcomes": [
            { "type": "success", "weight": 26 },
            { "type": "partial", "weight": 25 },
            { "type": "fail", "weight": 27 },
            { "type": "caught", "weight": 22 }
          ]
        }
      ]
    }
  ]
}