{
  "version": 3,
  "category": "ROBBERY",
  "defaults": {
    "messageIntervalSec": 4,
    "phaseSplit": { "setup": 0.25, "execution": 0.55, "climax": 0.20 },
    "cooldowns": { "onFailSec": 40, "onArrestSec": 75 }
  },
  "crimes": [
    {
      "type": "MUGGING",
      "name": "Mugging",
      "durationSeconds": 40,
      "paths": [
        {
          "setup": [
            "You trail a lone pedestrian turning onto a quiet side street.",
            "You spot someone counting cash outside a corner store."
          ],
          "execution": [
            "You close in, voice low enough for only them to hear.",
            "You step into their path, forcing them to stop.",
            "You demand their wallet without raising your voice."
          ],
          "climax": [
            "They hand over their money while glancing for help.",
            "A light comes on in a nearby window as you grab the cash."
          ],
          "ambient": [
            "Rain drips steadily from a loose gutter chain.",
            "A taxi idles nearby, turn signal clicking."
          ],
          "outcomes": [
            { "type": "success", "weight": 62 },
            { "type": "fail", "weight": 26 },
            { "type": "caught", "weight": 12 }
          ]
        },
        {
          "setup": [
            "You watch someone hesitate at a crosswalk, clearly lost.",
            "You follow a man walking alone with his bag slung behind him."
          ],
          "execution": [
            "You cut them off with a firm step forward.",
            "You keep your tone calm but your stance blocking their way."
          ],
          "climax": [
            "A siren sounds faintly in the distance.",
            "They look at you, then down at your hand, and comply."
          ],
          "ambient": [
            "Steam rises from a street grate.",
            "A cyclist weaves through the intersection without stopping."
          ],
          "outcomes": [
            { "type": "success", "weight": 58 },
            { "type": "fail", "weight": 30 },
            { "type": "caught", "weight": 12 }
          ]
        }
      ]
    },
    {
      "type": "BREAKING_AND_ENTERING",
      "name": "Breaking & entering",
      "durationSeconds": 55,
      "paths": [
        {
          "setup": [
            "You find a house with no cars in the driveway and lights off.",
            "You pass a quiet home where the curtains are only half-closed."
          ],
          "execution": [
            "You slip through the unlocked back door.",
            "You move room to room, taking only what you can carry.",
            "You avoid turning on any lights."
          ],
          "climax": [
            "A floorboard creaks loudly under your weight.",
            "Shadows move across the wall in the next room."
          ],
          "ambient": [
            "A refrigerator hums steadily in the kitchen.",
            "A wall clock ticks in the distance."
          ],
          "outcomes": [
            { "type": "success", "weight": 58 },
            { "type": "fail", "weight": 30 },
            { "type": "caught", "weight": 12 }
          ]
        },
        {
          "setup": [
            "You notice a back gate left open in a dimly lit yard.",
            "You approach a side door with peeling paint and no security camera."
          ],
          "execution": [
            "You turn the handle slowly until it clicks open.",
            "You walk through the hall, avoiding rugs that might hide squeaky boards."
          ],
          "climax": [
            "Headlights flash through the front windows.",
            "You freeze in place, listening for footsteps."
          ],
          "ambient": [
            "A neighbor coughs from across the fence.",
            "Pipes knock softly as the heater kicks on."
          ],
          "outcomes": [
            { "type": "success", "weight": 56 },
            { "type": "fail", "weight": 32 },
            { "type": "caught", "weight": 12 }
          ]
        }
      ]
    },
    {
      "type": "DRUG_DEALING",
      "name": "Drug dealing",
      "durationSeconds": 48,
      "paths": [
        {
          "setup": [
            "You take up a spot on a street corner with a clear line of sight to both ends.",
            "You wait in a quiet alley where customers know to find you."
          ],
          "execution": [
            "You hand off small packets in quick exchanges.",
            "You keep transactions short and eyes scanning the street.",
            "You nod to buyers and send them on their way."
          ],
          "climax": [
            "A car slows down, watching you too closely.",
            "Your heart rate spikes, but your hands stay calm."
          ],
          "ambient": [
            "Tires hiss through shallow puddles.",
            "A flickering streetlight blinks overhead."
          ],
          "outcomes": [
            { "type": "success", "weight": 64 },
            { "type": "fail", "weight": 22 },
            { "type": "caught", "weight": 14 }
          ]
        },
        {
          "setup": [
            "You stand under a broken streetlight to avoid being seen clearly.",
            "You carry your stash where a quick pat-down wouldn’t find it."
          ],
          "execution": [
            "You keep moving so no one stands near you too long.",
            "You spot someone hanging back, pretending to be on the phone."
          ],
          "climax": [
            "A siren sounds from a few streets over.",
            "You fold into the nearest crowd and walk away."
          ],
          "ambient": [
            "A bus rolls by, announcing stops to no one.",
            "Metal shutters rattle two shops down."
          ],
          "outcomes": [
            { "type": "success", "weight": 60 },
            { "type": "fail", "weight": 26 },
            { "type": "caught", "weight": 14 }
          ]
        }
      ]
    },
    {
      "type": "COUNTERFEIT_GOODS",
      "name": "Counterfeit goods",
      "durationSeconds": 52,
      "paths": [
        {
          "setup": [
            "You set up a stall with convincing knockoffs neatly arranged.",
            "You position yourself in a busy market where foot traffic is heavy."
          ],
          "execution": [
            "You talk up the quality before buyers can ask questions.",
            "You make small talk to distract from the too-good price.",
            "You watch for anyone lingering too long without buying."
          ],
          "climax": [
            "You start packing the stall quickly just in case.",
            "A man in plain clothes starts walking straight toward you."
          ],
          "ambient": [
            "Music from a nearby vendor blends with the crowd noise.",
            "Cash changes hands in a steady rhythm."
          ],
          "outcomes": [
            { "type": "success", "weight": 61 },
            { "type": "fail", "weight": 24 },
            { "type": "caught", "weight": 15 }
          ]
        },
        {
          "setup": [
            "You unpack bags of fake merchandise, swapping brand labels.",
            "You work in a spot where customers come looking for bargains."
          ],
          "execution": [
            "You spin a backstory for each item to make it seem authentic.",
            "You notice someone’s eyes scanning your stall instead of your products."
          ],
          "climax": [
            "You step away before they start asking questions.",
            "You offer one last deal to the nearest buyer and prepare to leave."
          ],
          "ambient": [
            "A customer loudly haggles at the next stall.",
            "The steady hum of generators fills the market."
          ],
          "outcomes": [
            { "type": "success", "weight": 58 },
            { "type": "fail", "weight": 27 },
            { "type": "caught", "weight": 15 }
          ]
        }
      ]
    }
  ]
}