{
  "version": 3,
  "category": "ROBBERY",
  "defaults": {
    "messageIntervalSec": 5,
    "phaseSplit": { "setup": 0.25, "execution": 0.50, "climax": 0.25 },
    "cooldowns": { "onFailSec": 60, "onArrestSec": 90 }
  },
  "crimes": [
    {
      "type": "MUGGING",
      "name": "Mugging",
      "durationSeconds": 75,
      "paths": [
        {
          "setup": [
            "The side street is dim and narrow, a shortcut most avoid after dark. A lone figure rounds the corner, their steps unhurried, bag hanging loose from one shoulder. You trail them, your shadow merging with theirs."
          ],
          "execution": [
            "You close in, voice low enough for only them to hear. Stepping into their path, you block the way forward, eyes steady as you demand their money. Your tone is calm, but the street feels smaller with each word."
          ],
          "climax": {
            "success": "They hand over their wallet without a fight, eyes darting for help that never comes. You vanish into the night before courage can return.",
            "partial": "They drop a few bills into your hand and back away fast. It’s not everything, but enough to keep you moving.",
            "fail": "They scream, startling you both. The noise draws light from a window above. You retreat empty-handed before it escalates.",
            "caught": "They resist, holding tight to their bag until a passerby shouts from across the street. Footsteps close in fast—you’re not walking away this time."
          },
          "ambient": [
            "Rain drips steadily from a loose gutter chain.",
            "A taxi idles nearby, its turn signal ticking like a heartbeat.",
            "The smell of damp asphalt lingers in the cool air.",
            "A window creaks open somewhere above.",
            "Your own footsteps echo too loud for comfort."
          ],
          "outcomes": [
            { "type": "success", "weight": 42 },
            { "type": "partial", "weight": 24 },
            { "type": "fail", "weight": 22 },
            { "type": "caught", "weight": 12 }
          ]
        }
      ]
    },
    {
      "type": "BREAKING_AND_ENTERING",
      "name": "Breaking & entering",
      "durationSeconds": 95,
      "paths": [
        {
          "setup": [
            "A quiet house waits at the end of the block. No cars in the drive, no lights behind the curtains. You check once more before slipping through the side gate."
          ],
          "execution": [
            "The door handle turns easily, and you slip inside. The air smells stale, as if no one has been here for days. You pad through the rooms in silence, bag swallowing whatever fits."
          ],
          "climax": {
            "success": "You fill your bag with valuables and exit the way you came, not a single sound drawing attention. The night swallows you whole.",
            "partial": "You grab a few small items but cut it short when a neighbor’s dog barks outside. It’s not much, but enough to risk carrying.",
            "fail": "A floorboard creaks loudly beneath you. The panic rising in your throat pushes you to leave empty-handed.",
            "caught": "Headlights sweep across the living room window. The lock clicks at the front door. You’re still inside when voices call out."
          },
          "ambient": [
            "A refrigerator hums quietly from the kitchen.",
            "A wall clock ticks with maddening precision.",
            "The house smells faintly of dust and wood polish.",
            "Pipes knock softly as the heater kicks in.",
            "A dog barks somewhere down the street."
          ],
          "outcomes": [
            { "type": "success", "weight": 40 },
            { "type": "partial", "weight": 25 },
            { "type": "fail", "weight": 23 },
            { "type": "caught", "weight": 12 }
          ]
        }
      ]
    },
    {
      "type": "DRUG_DEALING",
      "name": "Drug dealing",
      "durationSeconds": 85,
      "paths": [
        {
          "setup": [
            "The street corner has a clear line of sight in both directions. You lean against the wall, hands buried in your pockets, scanning without seeming to. The night feels tense, waiting."
          ],
          "execution": [
            "One by one, buyers drift past. A nod, a quick word, and a packet trades hands in the space of a breath. You keep the exchanges short, never lingering long enough to tempt suspicion."
          ],
          "climax": {
            "success": "Every buyer leaves satisfied, your stash lighter and your pockets heavier. The night ends without a ripple of trouble.",
            "partial": "A nervous buyer fumbles the exchange, drawing a glance from a passerby. You pull it off, but not without unease.",
            "fail": "Someone hangs back too long, pretending to talk on the phone. You pull away early, dumping the last packets to avoid heat.",
            "caught": "An unmarked car slows at the curb. By the time you notice, the doors are already opening."
          },
          "ambient": [
            "A flickering streetlight buzzes overhead.",
            "The faint hiss of tires passes through shallow puddles.",
            "A bus rolls by, announcing stops to an empty street.",
            "Music thumps from a passing car’s speakers.",
            "The smell of fried food wafts from a late-night cart."
          ],
          "outcomes": [
            { "type": "success", "weight": 41 },
            { "type": "partial", "weight": 26 },
            { "type": "fail", "weight": 21 },
            { "type": "caught", "weight": 12 }
          ]
        }
      ]
    },
    {
      "type": "COUNTERFEIT_GOODS",
      "name": "Counterfeit goods",
      "durationSeconds": 110,
      "paths": [
        {
          "setup": [
            "The market buzzes with voices, neon signs flickering above cramped stalls. Your knockoffs line the table neatly, waiting for the right eyes to notice. Bargain hunters drift close, curiosity caught by your prices."
          ],
          "execution": [
            "You greet each buyer with a warm smile, spinning a quick story about quality and deals too good to pass up. Bills change hands fast, and soon the stall hums with business. Still, you keep an eye on anyone lingering too long without buying."
          ],
          "climax": {
            "success": "The night ends in profit. You pack up what’s left and slip away, your stall forgotten as the crowd swallows the space.",
            "partial": "Sales come steady, but one customer haggles loud enough to draw attention. You make some money, but nerves shorten your stay.",
            "fail": "A shopper questions your stock too sharply, and the tension is enough to drive you to close early with little gained.",
            "caught": "A man in plain clothes approaches with steady eyes and no smile. The badge comes out before you can move."
          },
          "ambient": [
            "Music blares from a vendor’s radio, clashing with the crowd’s noise.",
            "The hum of generators fills the gaps between voices.",
            "Cash machines clink and shuffle nearby.",
            "The air smells of grilled meat and spices.",
            "Someone argues loudly two stalls over."
          ],
          "outcomes": [
            { "type": "success", "weight": 38 },
            { "type": "partial", "weight": 25 },
            { "type": "fail", "weight": 25 },
            { "type": "caught", "weight": 12 }
          ]
        }
      ]
    }
  ]
}
