{
  "version": 3,
  "category": "STREET_CRIMES",
  "defaults": {
    "messageIntervalSec": 3,
    "phaseSplit": { "setup": 0.25, "execution": 0.55, "climax": 0.20 },
    "cooldowns": { "onFailSec": 20, "onArrestSec": 45 }
  },
  "crimes": [
    {
      "type": "PICKPOCKETING",
      "name": "Pickpocketing",
      "durationSeconds": 22,
      "paths": [
        {
          "setup": [
            "You spot a commuter reading a text, purse strap hanging loose.",
            "A tourist studies a map with both hands, leaving pockets unguarded."
          ],
          "execution": [
            "You pretend to tie your shoe while edging close enough to reach.",
            "Your fingers slide over the zipper as if brushing past by accident.",
            "You lift the wallet with a practiced motion, never breaking stride.",
            "You pull the zipper halfway open before the crowd swallows you again."
          ],
          "climax": [
            "They suddenly pat their pocket, scanning the people nearby.",
            "A street performer shouts, masking your exit into the crowd."
          ],
          "ambient": [
            "A train brakes hard, metal screech echoing off the platform.",
            "An announcement blares through a distorted speaker.",
            "Warm air from a vent smells faintly of oil and dust."
          ],
          "outcomes": [
            { "type": "success", "weight": 65 },
            { "type": "fail", "weight": 25 },
            { "type": "caught", "weight": 10 }
          ]
        },
        {
          "setup": [
            "You notice a shopper with a backpack half-unzipped in a crowded crosswalk.",
            "A man walks with his jacket open, wallet bulging from the inside pocket."
          ],
          "execution": [
            "You match his pace, reaching as if adjusting your own coat.",
            "You hook two fingers into the open zipper and pull gently.",
            "You ease the wallet out in one motion before veering away."
          ],
          "climax": [
            "They turn around suddenly, forcing you to keep walking past.",
            "You slip behind a delivery truck before anyone calls out."
          ],
          "ambient": [
            "Shoes squeak on the tiled station floor.",
            "A busker strums a guitar, notes bouncing through the underpass."
          ],
          "outcomes": [
            { "type": "success", "weight": 60 },
            { "type": "fail", "weight": 30 },
            { "type": "caught", "weight": 10 }
          ]
        }
      ]
    },
    {
      "type": "SHOPLIFTING",
      "name": "Shoplifting",
      "durationSeconds": 26,
      "paths": [
        {
          "setup": [
            "You stroll into the store with an empty shopping bag ready.",
            "You hang near the self-checkout lanes, watching for distracted staff."
          ],
          "execution": [
            "You slide a package into your bag while pretending to compare prices.",
            "A small box disappears into your sleeve before you turn the corner.",
            "You drop the item under a folded sweater in your cart."
          ],
          "climax": [
            "The security gate waits ahead, red light steady.",
            "A clerk glances up from the register as you pass."
          ],
          "ambient": [
            "Barcode scanners beep steadily from the registers.",
            "Fluorescent lights hum overhead.",
            "A child whines for candy near the checkout."
          ],
          "outcomes": [
            { "type": "success", "weight": 62 },
            { "type": "fail", "weight": 26 },
            { "type": "caught", "weight": 12 }
          ]
        },
        {
          "setup": [
            "You spot an endcap display with no cameras pointed toward it.",
            "A store clerk steps into the back room, leaving an aisle empty."
          ],
          "execution": [
            "You slip the product into your bag in one clean motion.",
            "You palm the item and keep walking until it’s hidden away."
          ],
          "climax": [
            "The exit feels a lot farther than it looked when you came in.",
            "You step outside, glancing once over your shoulder."
          ],
          "ambient": [
            "A cart wheel rattles with each push.",
            "The air conditioner blows cold air down the aisles."
          ],
          "outcomes": [
            { "type": "success", "weight": 58 },
            { "type": "fail", "weight": 30 },
            { "type": "caught", "weight": 12 }
          ]
        }
      ]
    },
    {
      "type": "VANDALISM",
      "name": "Vandalism",
      "durationSeconds": 24,
      "paths": [
        {
          "setup": [
            "You find a blank wall on a side street with no foot traffic.",
            "You approach a boarded-up storefront just after dark."
          ],
          "execution": [
            "You shake the spray can once and start your tag.",
            "A fresh coat of paint covers an old, faded mural.",
            "You add quick lines, working from muscle memory."
          ],
          "climax": [
            "A light switches on in a nearby window.",
            "You step back, admiring your work before moving on."
          ],
          "ambient": [
            "A distant bass beat thuds from a passing car.",
            "Glass clinks in a trash bin down the block."
          ],
          "outcomes": [
            { "type": "success", "weight": 70 },
            { "type": "fail", "weight": 20 },
            { "type": "caught", "weight": 10 }
          ]
        },
        {
          "setup": [
            "You wait behind a dumpster until the street is quiet.",
            "You walk past a concrete wall tagged by someone else and decide to add your own."
          ],
          "execution": [
            "Paint mist hangs in the cool night air as you work.",
            "You keep glancing over your shoulder between each line."
          ],
          "climax": [
            "A car turns onto the street, headlights sweeping over you.",
            "The wall’s colors pop under the dim streetlamp."
          ],
          "ambient": [
            "A stray cat trots across the sidewalk.",
            "Wind hums through a chain-link fence."
          ],
          "outcomes": [
            { "type": "success", "weight": 68 },
            { "type": "fail", "weight": 22 },
            { "type": "caught", "weight": 10 }
          ]
        }
      ]
    },
    {
      "type": "PETTY_SCAM",
      "name": "Petty scam",
      "durationSeconds": 28,
      "paths": [
        {
          "setup": [
            "You wave over a passerby who slowed when they saw your table.",
            "You greet a tourist who’s glancing between your stand and a guidebook."
          ],
          "execution": [
            "You pitch a deal that sounds too good to ignore.",
            "You act friendly while steering them toward the choice you want.",
            "You make the price seem like a special offer just for them."
          ],
          "climax": [
            "They hesitate, eyes flicking between you and the item.",
            "They reach for their wallet but don’t commit yet."
          ],
          "ambient": [
            "A bus wheezes to a stop nearby.",
            "Pigeons scatter as someone walks past too quickly."
          ],
          "outcomes": [
            { "type": "success", "weight": 60 },
            { "type": "fail", "weight": 25 },
            { "type": "caught", "weight": 15 }
          ]
        },
        {
          "setup": [
            "You catch the attention of someone leaning against a storefront.",
            "You open with a joke to break the ice with a stranger walking past."
          ],
          "execution": [
            "You keep your hands still and let your story carry the pitch.",
            "You answer their questions with quick, confident replies."
          ],
          "climax": [
            "A phone buzz interrupts their focus.",
            "They give you one last look before deciding."
          ],
          "ambient": [
            "Someone claps once from across the street.",
            "Two musicians argue about who’s off-beat."
          ],
          "outcomes": [
            { "type": "success", "weight": 58 },
            { "type": "fail", "weight": 27 },
            { "type": "caught", "weight": 15 }
          ]
        }
      ]
    }
  ]
}