{
  "version": 3,
  "category": "STREET_CRIMES",
  "defaults": {
    "messageIntervalSec": 3,
    "phaseSplit": { "setup": 0.25, "execution": 0.55, "climax": 0.20 },
    "cooldowns": { "onFailSec": 20, "onArrestSec": 45 }
  },
  "crimes": [
    {
      "type": "PICKPOCKETING",
      "name": "Pickpocketing",
      "durationSeconds": 22,
      "paths": [
        {
          "setup": [
            "You pick a mark who walks like time matters more than pockets.",
            "The platform hums; announcements blur into white noise."
          ],
          "execution": [
            "You drift closer on a lazy turn, eyes on the schedule board.",
            "The strap creaks—a warning or just leather breathing?",
            "Your fingertips read the stitch like braille, heartbeat in your throat.",
            "A jostle from behind gives cover you didn’t ask for."
          ],
          "climax": [
            "Their head tilts half a degree; your reflection swims in the window.",
            "You pivot with the crowd, laughter from strangers masking your exit."
          ],
          "outcomes": [
            { "type": "success", "weight": 65 },
            { "type": "fail", "weight": 25 },
            { "type": "caught", "weight": 10 }
          ]
        },
        {
          "setup": [
            "You match their cadence, just another commuter in a river of coats.",
            "Your shoulder turns; the bag grazes your sleeve—chance meets muscle memory."
          ],
          "execution": [
            "Heat from their coat warms your knuckles; distance shrinks to nothing.",
            "Cloth sighs; the zipper hesitates like a breath.",
            "You feel the weight loosen, gravity suddenly on your side."
          ],
          "climax": [
            "Footsteps speed up behind you—every sound feels aimed at your spine.",
            "The wallet is either yours… or you’re about to explain a mistake."
          ],
          "outcomes": [
            { "type": "success", "weight": 60 },
            { "type": "fail", "weight": 30 },
            { "type": "caught", "weight": 10 }
          ]
        }
      ]
    },
    {
      "type": "SHOPLIFTING",
      "name": "Shoplifting",
      "durationSeconds": 26,
      "paths": [
        {
          "setup": [
            "Fluorescents buzz; the aisle smells like plastic and citrus cleaner.",
            "You loop once, twice, letting the cameras forget your face."
          ],
          "execution": [
            "The package edges against your palm, light as an excuse.",
            "You set the cart rolling, a prop that buys you seconds.",
            "An endcap display tries to fall—your hand says not today."
          ],
          "climax": [
            "Security domes glare like tiny moons overhead.",
            "The sensor gate waits, red LED a single judgment."
          ],
          "outcomes": [
            { "type": "success", "weight": 62 },
            { "type": "fail", "weight": 26 },
            { "type": "caught", "weight": 12 }
          ]
        },
        {
          "setup": [
            "A clerk jokes with a customer, eyes drifting the other way.",
            "Your reflection in a freezer door practices indifference."
          ],
          "execution": [
            "You slip the item where certainty looks like routine.",
            "You pick a lane where no one learns your name."
          ],
          "climax": [
            "You breathe in, out; shoes whisper over tiles.",
            "On the other side, the air will taste different."
          ],
          "outcomes": [
            { "type": "success", "weight": 58 },
            { "type": "fail", "weight": 30 },
            { "type": "caught", "weight": 12 }
          ]
        }
      ]
    },
    {
      "type": "VANDALISM",
      "name": "Vandalism",
      "durationSeconds": 24,
      "paths": [
        {
          "setup": [
            "You choose a wall that tried to forget the city.",
            "Wind tugs at your hood; night presses close but not unkind."
          ],
          "execution": [
            "The can rattles—your signature waking up.",
            "Color blooms where concrete gave up years ago.",
            "Your lines find the curve your hand wanted all day."
          ],
          "climax": [
            "A porch light snicks on; your heartbeat edits the plan.",
            "You dot the last letter like a promise you mean."
          ],
          "outcomes": [
            { "type": "success", "weight": 70 },
            { "type": "fail", "weight": 20 },
            { "type": "caught", "weight": 10 }
          ]
        },
        {
          "setup": [
            "A distant siren sketches a rhythm you can color inside.",
            "You listen for footsteps that only exist in your head."
          ],
          "execution": [
            "Paint fog hangs like a halo around your crime.",
            "Somewhere glass clinks; in your world it’s applause."
          ],
          "climax": [
            "You step back once to see if it was worth the risk.",
            "The wall looks louder than the street."
          ],
          "outcomes": [
            { "type": "success", "weight": 68 },
            { "type": "fail", "weight": 22 },
            { "type": "caught", "weight": 10 }
          ]
        }
      ]
    },
    {
      "type": "PETTY_SCAM",
      "name": "Petty scam",
      "durationSeconds": 28,
      "paths": [
        {
          "setup": [
            "You warm the pitch till it sounds like their own idea.",
            "A passerby slows, curiosity tugging their sleeve."
          ],
          "execution": [
            "You lay out choices that all point to you.",
            "They laugh where you expect; a good sign, or bait.",
            "You nod like you’ve known each other for years."
          ],
          "climax": [
            "They glance at a watch, the decision inside that look.",
            "You hold the silence like it owes you money."
          ],
          "outcomes": [
            { "type": "success", "weight": 60 },
            { "type": "fail", "weight": 25 },
            { "type": "caught", "weight": 15 }
          ]
        },
        {
          "setup": [
            "You ask a question with an answer you’ve already scripted.",
            "Their smile flickers; a door opens and waits."
          ],
          "execution": [
            "Your hands stay still; your story does all the moving.",
            "They test a detail; you pass like you studied for it."
          ],
          "climax": [
            "A phone buzzes between you—fate is terrible with timing.",
            "One word from them turns the world either way."
          ],
          "outcomes": [
            { "type": "success", "weight": 58 },
            { "type": "fail", "weight": 27 },
            { "type": "caught", "weight": 15 }
          ]
        }
      ]
    }
  ]
}
