{
  "version": 3,
  "category": "STREET_CRIMES",
  "defaults": {
    "messageIntervalSec": 4,
    "phaseSplit": { "setup": 0.25, "execution": 0.50, "climax": 0.25 },
    "cooldowns": { "onFailSec": 30, "onArrestSec": 60 }
  },
  "crimes": [
    {
      "type": "PICKPOCKETING",
      "name": "Pickpocketing",
      "durationSeconds": 45,
      "paths": [
        {
          "setup": [
            "The subway platform heaves with people spilling from the train. Elbows bump, voices clash, and wallets dangle in careless pockets. One man leans against a column, phone in hand, jacket loose and bulging where his wallet rests."
          ],
          "execution": [
            "You slide closer, weaving through the crush of strangers. A fake stumble takes you within reach. Your fingers brush the zipper, tug it open, and pinch leather between two fingers before the moment can vanish."
          ],
          "climax": {
            "success": "The wallet slips free and drops into your pocket like it was always yours. You melt into the flow of bodies without a second glance.",
            "partial": "You snag the wallet but nearly drop it. A sharp motion from the target makes you flinch; you recover, but the escape is sloppy.",
            "fail": "The man shifts his weight and the wallet slides deeper out of reach. You let the chance die and keep walking, blending into the crowd.",
            "caught": "His hand clamps around your wrist before you pull away. The look on his face sharpens the air, and voices shout for the police."
          },
          "ambient": [
            "A train screeches to a halt, brakes screaming in metal protest.",
            "An announcement crackles overhead, distorted beyond recognition.",
            "The air smells of oil, sweat, and electricity."
          ],
          "outcomes": [
            { "type": "success", "weight": 48 },
            { "type": "partial", "weight": 24 },
            { "type": "fail", "weight": 18 },
            { "type": "caught", "weight": 10 }
          ]
        }
      ]
    },
    {
      "type": "SHOPLIFTING",
      "name": "Shoplifting",
      "durationSeconds": 50,
      "paths": [
        {
          "setup": [
            "The store hums under fluorescent light, shelves stacked with tidy rows of goods. A clerk bends over at the far register, too absorbed in receipts to watch you. Your bag hangs open at your side, ready."
          ],
          "execution": [
            "You stroll the aisle once, pretending to compare prices. A small box finds its way into your hand, and after a second’s pause, it slides under the sweater draped across your cart. You turn down another aisle, as if bored with what you saw."
          ],
          "climax": {
            "success": "The sensor gate stays silent. You push through the doors and breathe the outside air, pulse steady as if nothing ever happened.",
            "partial": "The sensor chirps faintly, making you stiffen. The clerk doesn’t look up, and you keep walking, heart hammering.",
            "fail": "The clerk glances up just as you slip the box away. Their stare lingers too long, forcing you to ditch the item and leave empty-handed.",
            "caught": "The alarm shrieks as you cross the gate. A hand seizes your arm before you take two more steps."
          },
          "ambient": [
            "Barcode scanners beep in a steady chorus.",
            "A shopping cart squeals down the next aisle.",
            "Fluorescent lights hum without pause."
          ],
          "outcomes": [
            { "type": "success", "weight": 47 },
            { "type": "partial", "weight": 25 },
            { "type": "fail", "weight": 18 },
            { "type": "caught", "weight": 10 }
          ]
        }
      ]
    },
    {
      "type": "VANDALISM",
      "name": "Vandalism",
      "durationSeconds": 40,
      "paths": [
        {
          "setup": [
            "The alley lies still, blank concrete stretching under a weak streetlamp. A rival’s mark stains one wall, daring anyone to paint over it. Your hand closes around the cold can in your pocket."
          ],
          "execution": [
            "You shake it once, the rattle sharp in the quiet. The first hiss of color splashes across the bricks, quick strokes carving your claim. You pause only to glance over your shoulder before tracing the next line."
          ],
          "climax": {
            "success": "The tag glows bold under dim light. You step back, admire your work, and vanish before the night can answer.",
            "partial": "The paint runs on damp brick, blurring the edges. It isn’t clean, but it leaves your mark.",
            "fail": "The nozzle sputters and clogs, spraying weak mist. You curse, toss the can, and leave the job half-finished.",
            "caught": "Headlights turn into the alley, freezing you mid-stroke. A shout cuts through the dark—you’re not alone anymore."
          },
          "ambient": [
            "Wind whistles through the chain-link fence.",
            "A glass bottle rolls across the pavement.",
            "A dog barks twice before falling silent."
          ],
          "outcomes": [
            { "type": "success", "weight": 50 },
            { "type": "partial", "weight": 23 },
            { "type": "fail", "weight": 17 },
            { "type": "caught", "weight": 10 }
          ]
        }
      ]
    },
    {
      "type": "PETTY_SCAM",
      "name": "Petty scam",
      "durationSeconds": 55,
      "paths": [
        {
          "setup": [
            "Your folding table sits crooked against a storefront wall. Trinkets and knockoffs gleam under cheap light. A tourist slows, curiosity pulling them closer, guidebook still clutched in hand."
          ],
          "execution": [
            "You greet them warmly, voice smooth and easy. With a quick joke and a smile, you pivot into your pitch, building the offer step by step until the deal sounds better than it is. Their hand drifts toward their wallet."
          ],
          "climax": {
            "success": "They pay without hesitation, smiling like they won. You pocket the bills and thank them like an old friend.",
            "partial": "They hesitate, eyes flicking between you and the item. They don’t buy, but they linger, interest hooked for another time.",
            "fail": "They laugh off your offer and keep walking. You fold your smile and wait for the next fool to wander by.",
            "caught": "A uniform pushes through the crowd, eyes fixed on you. The tourist steps back as the officer reaches for your stall."
          },
          "ambient": [
            "A bus sighs to a stop nearby, brakes squealing.",
            "Pigeons scatter at the clap of a door slamming shut.",
            "Street musicians argue over the tempo of their song."
          ],
          "outcomes": [
            { "type": "success", "weight": 45 },
            { "type": "partial", "weight": 27 },
            { "type": "fail", "weight": 18 },
            { "type": "caught", "weight": 10 }
          ]
        }
      ]
    }
  ]
}